#include "PixelDirectionalLighting.h"
#include "sprite.h"
#include "Camera.h"
#include "texture.h"
#include "model.h"
#include "keyboard.h"
//=========================================================================================================
// 〇〇
//=========================================================================================================



//=========================================================================================================
// 初期化処理
//=========================================================================================================
void PixelDirectionalLighting::Init(void)
{
	PolygonModel::Init();

	m_Is2D = false;		//2DオブジェクトフラグOFF

	//モデルの位置
	m_Position = XMFLOAT3(1.0f, 0.2f, 0.0f);

	//シェーダー読み込み
	CreateVertexShader(&VertexShader, &VertexLayout, "PixelDirectionalLightingVS.cso");
	CreatePixelShader(&PixelShader, "PixelDirectionalLightingPS.cso");

};

//=========================================================================================================
// 終了処理
//=========================================================================================================
void PixelDirectionalLighting::Finalize(void)
{
	PolygonModel::Uninit();
}

//=========================================================================================================
// 更新処理
//=========================================================================================================
void PixelDirectionalLighting::Update(void)
{
	PolygonModel::Update();
}

//=========================================================================================================
// 描画処理
//=========================================================================================================
void PixelDirectionalLighting::Draw(void)
{
	PolygonModel::Draw();
}