/*==============================================================================

[CookTorrance.cpp]
														Author :Watanabe Retsu
														Date   :2026/06/15
--------------------------------------------------------------------------------

==============================================================================*/
//==============================================================================
//インクルード
//==============================================================================
#include "CookTorrance.h"

//==============================================================================
//初期化処理
//==============================================================================
void  CookTorrance::Init(void)
{
	PolygonModel::Init();

	m_Position = XMFLOAT3(1.5f, 0.5f, 0.0f);

	//パラメータ初期値
	m_Parameter = XMFLOAT4(0, 0, 0, 0);
	m_Parameter.x = 0.3f; //ざらつき(Roughness)
	m_Parameter.y = 0.8f; //金属感(Metallic)

	// ライト構造体の初期化
	XMVECTOR dir = XMVectorSet(0.0f, -1.0f, 1.0f, 0.0f);
	XMStoreFloat4(&m_Light.Direction, dir);//コーンの向き
	m_Light.Position = XMFLOAT4(0.0f, 1.0f, 0.0f, 1.0f);
	m_Light.Diffuse = XMFLOAT4(1.0f, 1.0f, 1.0f, 1.0f);	//拡散光の色
	m_Light.Ambient = XMFLOAT4(0.1f, 0.1f, 0.1f, 1.0f);	//環境光の色
	m_Light.SkyColor = XMFLOAT4(0.6f, 0.0f, 0.0f, 1.0f);
	m_Light.GroundColor = XMFLOAT4(0.0f, 0.6f, 0.0f, 1.0f);
	m_Light.PointLightParam = XMFLOAT4(10.0f, 1.0f, 1.0f, 0.0f);
}
//=============================================================================
// 終了処理
//=============================================================================
void CookTorrance::Uninit(void)
{
	PolygonModel::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CookTorrance::Update(void)
{
	PolygonModel::Update();
}

//=============================================================================
// 描画処理
//=============================================================================
void CookTorrance::Draw(void)
{
	SetParameter(m_Parameter);	//Parameterをシェーダーへ送る
	PolygonModel::Draw();
}

//=============================================================================
// ImGui描画
//=============================================================================
void CookTorrance::DrawImGuiExtra()
{

	ImGui::SeparatorText("CookTorrance");
	ImGui::SliderFloat("Roughness", &m_Parameter.x, 0.0f, 1.0f, "%.1f");
	ImGui::SliderFloat("Metallic ", &m_Parameter.y, 0.0f, 1.0f, "%.1f");

}